# Дано целое число n (n находится в диапазоне от 1 до 99), определяющее возраст человека в годах. Для этого числа необходимо напечатать фразу "мне n лет".
# учитывайте, что при некоторых значениях n слово "лет" нужно заменить на слово "год" или "года".

n = int(input("Введите возраст"))
if n == 1:
    print("Мне", n, "год")
elif 1 < 5:
    print("Мне", n, "года")
elif 4 < 21:
    print("Мне", n, "лет")
elif n == 21:
    print("Мне", n, "год")
elif 21 < 25:
    print("Мне", n, "года")
elif 24<n<31:
    print("Мне", n, "лет")
elif n == 31:
    print("Мне", n, "год")
elif 31<n<35:
    print("Мне", n, "года")
elif 34<n<41:
    print("Мне", n, "лет")
elif n == 41:
    print("Мне", n, "год")
elif 41<n<45:
    print("Мне", n, "года")
elif 44<n<51:
    print("Мне", n, "лет")
elif n == 51:
    print("Мне", n, "год")
elif 51<n<55:
    print("Мне", n, "года")
elif 54<n<61:
    print("Мне", n, "лет")
elif n == 61:
    print("Мне", n, "год")
elif 61<n<65:
    print("Мне", n, "года")
elif 64<n<71:
    print("Мне", n, "лет")
elif n == 71:
    print("Мне", n, "год")
elif 71<n<75:
    print("Мне", n, "года")
elif 74<n<71:
    print("Мне", n, "лет")
elif n == 81:
    print("Мне", n, "год")
elif 81<n<85:
    print("Мне", n, "года")
elif 84<n<91:
    print("Мне", n, "лет")
elif n == 91:
    print("Мне", n, "год")
elif 91<n<95:
    print("Мне", n, "года")
elif 94<n<100:
    print("Мне", n, "лет")